app/controllers/admin/abilities_controller.rb

    def index
      @abilities = Ability.all.order(:ability_name)
---
SELECT "abilities".* FROM "abilities" ORDER BY "abilities"."ability_name" ASC

    def edit
      @ability = Ability.find(params[:id])
---
SELECT  "abilities".* FROM "abilities" WHERE "abilities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
      @ability = Ability.new(ability_params)

      if @ability.save
---
INSERT INTO "abilities" ("created_at", "updated_at", "ability_name") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", 2017-11-15 04:32:28 UTC], ["updated_at", 2017-11-15 04:32:28 UTC], ["ability_name", "Manejo de Word"]]

    def update
      @ability = Ability.find(params[:id])

      if @ability.update(ability_params)
---
SELECT  "abilities".* FROM "abilities" WHERE "abilities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "abilities" SET "ability_name" = $1, "updated_at" = $2 WHERE "abilities"."id" = $3  [["ability_name", "Manejo de Excel"], ["updated_at", 2017-11-15 04:33:30 UTC], ["id", 1]]

    def destroy
      @ability = Ability.find(params[:id])
      @ability.destroy
---
SELECT  "abilities".* FROM "abilities" WHERE "abilities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "abilities" WHERE "abilities"."id" = $1  [["id", 1]]