app/controllers/admin/application_controller.rb

SELECT  "homes".* FROM "homes" LIMIT $1  [["LIMIT", 1]]
---
    def index
      @home = Home.all.limit(1)