app/controllers/admin/areas_controller.rb

    def index
      @areas = Area.all
---
SELECT "areas".* FROM "areas"

    def create
      @area = Area.new(area_params)

      if @area.save
---
INSERT INTO "areas" ("created_at", "updated_at", "name", "area_id_number") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", 2017-11-15 04:39:48 UTC], ["updated_at", 2017-11-15 04:39:48 UTC], ["name", "Test"], ["area_id_number", "1"]]

    def edit
      @area = Area.find(params[:id])
---
SELECT  "areas".* FROM "areas" WHERE "areas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update
      @area = Area.find(params[:id])

      if @area.update_attributes(area_params)
---
SELECT  "areas".* FROM "areas" WHERE "areas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "areas" SET "name" = $1, "updated_at" = $2 WHERE "areas"."id" = $3  [["name", "Testing"], ["updated_at", 2017-11-15 04:40:04 UTC], ["id", 1]]

    def destroy
      @area = Area.find(params[:id])
      @area.destroy
---
SELECT  "areas".* FROM "areas" WHERE "areas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "areas" WHERE "areas"."id" = $1  [["id", 1]]