app/controllers/admin/departments_controller.rb

    def new
      @department = Department.new
      @areas = Area.all
---
SELECT "areas".* FROM "areas"

    def create
      @exist = false
      @departments = Department.all

      @departments.each do |department|
        if(department.department_id_number == department_params[:department_id_number])
         @exist = true
       end
      end

      @department = Department.new(department_params)

      if !@exist
        if @department.save
---
INSERT INTO "departments" ("area_id", "created_at", "updated_at", "name", "department_id_number") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["area_id", 1], ["created_at", 2017-11-15 04:45:40 UTC], ["updated_at", 2017-11-15 04:45:40 UTC], ["name", "A.I"], ["department_id_number", "1"]]

    def edit
      @department = Department.find(params[:id])
      @areas = Area.all
---
SELECT  "departments".* FROM "departments" WHERE "departments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "areas".* FROM "areas"

    def update
      @department = Department.find(params[:id])

      if @department.update_attributes(department_params)
---
SELECT  "departments".* FROM "departments" WHERE "departments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "departments" SET "name" = $1, "updated_at" = $2 WHERE "departments"."id" = $3  [["name", "U.A.V"], ["updated_at", 2017-11-15 04:45:51 UTC], ["id", 1]]

    def destroy
      @department = Department.find(params[:id])
      @department.destroy
---
SELECT  "departments".* FROM "departments" WHERE "departments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "departments" WHERE "departments"."id" = $1  [["id", 1]]