app/controllers/admin/educations_controller.rb

    def index
        @educations = Education.all
---
SELECT "educations".* FROM "educations"

    def create
      @education = Education.new(education_params)

      if @education.save
---
INSERT INTO "educations" ("major_description", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["major_description", "Licenciatura"], ["created_at", 2017-11-15 04:37:25 UTC], ["updated_at", 2017-11-15 04:37:25 UTC]]

    def edit
      @education = Education.find(params[:id])
---
SELECT  "educations".* FROM "educations" WHERE "educations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update
      @education = Education.find(params[:id])

      if @education.update_attributes(education_params)
---
SELECT  "educations".* FROM "educations" WHERE "educations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "educations" SET "major_description" = $1, "updated_at" = $2 WHERE "educations"."id" = $3  [["major_description", "Ingenieria"], ["updated_at", 2017-11-15 04:37:44 UTC], ["id", 1]]

    def destroy
      @education = Education.find(params[:id])
      @education.destroy
---
SELECT  "educations".* FROM "educations" WHERE "educations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "educations" WHERE "educations"."id" = $1  [["id", 1]]