app/controllers/admin/employees_controller.rb

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "abilities_employees".* FROM "abilities_employees" WHERE (employee_id = '5')
SELECT "educations_employees".* FROM "educations_employees" WHERE (employee_id = '1')
---
    def show
        @employee = Employee.find(params[:id])
        @employee_abilities = AbilitiesEmployee.where("employee_id = ?", params[:id])
        @employee_education = EducationsEmployee.where("employee_id = ?", params[:id])

SELECT "positions".* FROM "positions"
SELECT "abilities".* FROM "abilities"
SELECT "educations".* FROM "educations"
SELECT "schools".* FROM "schools"
---
    def new
      @employee = Employee.new
      @positions = Position.all
      @abilities = Ability.all
      @educations = Education.all
      @schools = School.all

SELECT "positions".* FROM "positions"
INSERT INTO "employees" ("created_at", "updated_at", "position_id", "name", "birth_date", "birth_place", "hired_date", "salary", "marital_status", "address", "blood_type", "emergency_contact_number", "emergency_contact_name", "email", "rap_code", "cellphone", "bank_account", "contract_type", "gender", "employee_status", "id_number", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "company", "employee_id_number") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27) RETURNING "id"
---
    def create
      @employee = Employee.new(employee_params)
      @employee.hired_date = Date.today
      @employee.employee_status = true
      @positions = Position.all

      if  @employee.save

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "positions".* FROM "positions"
SELECT "abilities".* FROM "abilities"
SELECT "educations".* FROM "educations"
SELECT "schools".* FROM "schools"
---
    def edit
        @employee = Employee.find(params[:id])
        @positions = Position.all
        @abilities = Ability.all
        @educations = Education.all
        @schools = School.all

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "employees" SET "image_file_name" = $1, "image_content_type" = $2, "image_file_size" = $3, "image_updated_at" = $4, "updated_at" = $5 WHERE "employees"."id" = $6  [["image_file_name", "hawt.jpg"], ["image_content_type", "image/jpeg"], ["image_file_size", 4998], ["image_updated_at", 2017-11-15 12:20:43 UTC], ["updated_at", 2017-11-15 12:20:43 UTC], ["id", 1]]
---
    def update
        @employee = Employee.find(params[:id])

        if @employee.update_attributes(employee_params)