app/controllers/admin/homes_controller.rb

SELECT "homes".* FROM "homes"
---
		def new
			@home = Home.all