app/controllers/admin/positions_controller.rb

SELECT "positions".* FROM "positions"
---
    def index
      @positions = Position.all

SELECT "departments".* FROM "departments"
---
    def new
      @position = Position.new
      @abilities = Ability.all
      @educations = Education.all
      @departments = Department.all

INSERT INTO "positions" ("created_at", "updated_at", "department_id", "name", "position_id_number") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", 2017-11-15 04:48:05 UTC], ["updated_at", 2017-11-15 04:48:05 UTC], ["department_id", 1], ["name", "Gerente"], ["position_id_number", "1"]]
---
    def create
      @position = Position.new(position_params)

      if @position.save

SELECT  "positions".* FROM "positions" WHERE "positions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "departments".* FROM "departments"
---
    def edit
      @position = Position.find(params[:id])
      @departments = Department.all

SELECT  "positions".* FROM "positions" WHERE "positions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "positions" SET "name" = $1, "updated_at" = $2 WHERE "positions"."id" = $3  [["name", "Programador"], ["updated_at", 2017-11-15 04:48:13 UTC], ["id", 1]]
---
    def update
      @position = Position.find(params[:id])

      if @position.update_attributes(position_params)

SELECT  "positions".* FROM "positions" WHERE "positions"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "positions" WHERE "positions"."id" = $1  [["id", 4]]
---
    def destroy
      @position = Position.find(params[:id])
      @position.destroy