app/controllers/admin/schools_controller.rb

SELECT "schools".* FROM "schools" ORDER BY "schools"."name" ASC
---
    def index
      @schools = School.order(:name)

INSERT INTO "schools" ("created_at", "updated_at", "name") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", 2017-11-15 04:02:17 UTC], ["updated_at", 2017-11-15 04:02:17 UTC], ["name", "Unah-vs"]]
---
    def create
      @school = School.new(school_params)
      if @school.save

SELECT  "schools".* FROM "schools" WHERE "schools"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def edit
      @school = School.find(params[:id])

SELECT  "schools".* FROM "schools" WHERE "schools"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "schools" SET "name" = $1, "updated_at" = $2 WHERE "schools"."id" = $3  [["name", "Unah-tgu"], ["updated_at", 2017-11-15 04:25:19 UTC], ["id", 1]]
---
    def update
      @school = School.find(params[:id])

      if @school.update_attributes(school_params)

SELECT  "schools".* FROM "schools" WHERE "schools"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "schools" WHERE "schools"."id" = $1  [["id", 1]]
---
    def destroy
      @school = School.find(params[:id])
      @school.destroy