app/views/admin/employees/show.html.erb

          <% @employee_abilities.each do |employee_abilities| %>
            <% @_school =  School.select('name').find(employee_abilities.school_id)%>
            <% @_ability =  Ability.select('ability_name').find(employee_abilities.ability_id)%>
---
SELECT  "schools"."name" FROM "schools" WHERE "schools"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "abilities"."ability_name" FROM "abilities" WHERE "abilities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

            <% @_school =  School.select('name').find(employee_education.school_id)%>
            <% @_education = Education.select('major_description').find(employee_education.education_id)%>
---
SELECT  "educations"."major_description" FROM "educations" WHERE "educations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]